---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeRadialDimensionTypeId
source: html/592f5eb4-76a4-94bd-cb0f-ad7c447ac389.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeRadialDimensionTypeId Property

"Radial Dimension Style"

## Syntax (C#)
```csharp
public static ForgeTypeId BendingDetailTypeRadialDimensionTypeId { get; }
```